RIET/src/AccumulationRegisters/НеоплаченныеТПО/НеоплаченныеТПО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НеоплаченныеТПО</name>
  <resources>
    <name>Sum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТПО</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PaymentKind</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/НеоплаченныеТПО/RecordSetModule.bsl
Процедура ДобавитьЗапись(ВидДвижения, Период, CustomsReceiptOrder, PaymentKind=Неопределено, Sum) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВидДвижения) Тогда
		ВызватьИсключение "Вид движения is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		ВызватьИсключение "Период is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(CustomsReceiptOrder) Тогда
		ВызватьИсключение "Customs receipt order is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Sum) Тогда
		ВызватьИсключение "Sum is empty!";
	КонецЕсли;
	
	Движение = Добавить();
	Движение.ВидДвижения = ВидДвижения;
	Движение.Период = Период;
	Движение.ТПО = CustomsReceiptOrder;
	Движение.PaymentKind = PaymentKind;
	Движение.Sum = Sum;
	
КонецПроцедуры
